<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN">
<html>
<head>
<title>Minell´s HTML - Kapitel 11 - Sammanfattning</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<meta name="generator" content="Dreamweaver MX, CSS, Anteckningar">
<meta name="keywords" content="HTML-kurs, html, html-editorer, scriptspråk">
<meta name="description" content="Denna sida är en HTML-kurs för nybörjare. Sidan innehåller både fakta, koder och uppgifter.">
<meta name="author" content="Copyright Carina Minell">
<link href="layout.css" rel="stylesheet" type="text/css">
</head>
<body>
<div id="layout">
<div id="sidhuvud">
  <h2><a href="Kapitel2/index.htm"><img src="bilder2/nylogga2.gif" alt="Länk till startsidan" width="471" height="90" border="0"></a></h2>
  </div>
<div id="menycontainer">
<ul>
    <li><a href="index.htm" >Startsida</a></li>
	<li><a href="kapitel1.htm" >Kapitel 1</a></li>
    <li><a href="kapitel2.htm">Kapitel 2</a></li>
    <li><a href="kapitel3.htm">Kapitel 3</a></li>
    <li><a href="Kkapitel4.htm">Kapitel 4</a></li>
	<li><a href="kapitel5.htm">Kapitel 5</a></li>
    <li><a href="kapitel6.htm">Kapitel 6</a></li>
    <li><a href="kapitel7.htm">Kapitel 7</a></li>
    <li><a href="kapitel8.htm">Kapitel 8</a></li>
	<li><a href="kapitel9.htm">Kapitel 9</a></li>
    <li><a href="kapitel10.htm">Kapitel 10</a></li>
    <li><a href="kapitel11.htm" id="current">Kapitel 11</a></li>

</ul>
</div>
<div id="kolumncontainer">
<div id="kolumn1">
<h1>Kapitel 11 - Sammanfattning </h1>
<p align="left">Som du s&auml;kert f&ouml;rst&aring;tt har denna kurs bara tagit upp det mest grundl&auml;ggande delarna i HTML-kodning. Givetvis finns det massor av andra saker som du b&ouml;r k&auml;nna till och s&ouml;ka mer kunskap om vad det g&auml;ller t ex grafisk formgivning, layout, stillmallar, gr&auml;nssnitt, multimedia, l&auml;sbarhet, funktionalitet och kompabilitet. <br>
P&aring; f&ouml;ljande 4 sidor kommer jag att ta upp lite om n&aring;gra scriptspr&aring;k, programmeringsspr&aring;k, editorer, Meta-taggar, ftp, och lagar p&aring; Internet. </p>
<h3><strong>Planering av sidan </strong></h3>
<p align="left">N&auml;r du skall g&ouml;ra din f&ouml;rsta "seri&ouml;sa" webbsida b&ouml;r du f&ouml;rst g&ouml;ra en ordentlig planering. Att planera, organisera och strukturera en webbsida &auml;r viktigt f&ouml;r det fortsatta arbetet. G&ouml;r g&auml;rna en s&aring; kallad storyboard, d&auml;r du skissar upp webbsidans struktur och ungef&auml;rliga inneh&aring;ll. <br>
  Andra fr&aring;gor du b&ouml;r besvara under planeringsfasen &auml;r: </p>
<ul>
  <li><strong>Syftet </strong> - Varf&ouml;r g&ouml;r jag denna sida?
    <li><strong>M&aring;lgrupp </strong> - Vilken &auml;r min m&aring;lgrupp?
    <li><strong>M&aring;l </strong> - Vad &auml;r m&aring;let med webbsidan? </li>
</ul>
<p>Planeringsfasen &auml;r mycket st&ouml;rre &auml;n det jag beskriver h&auml;r, du kan l&auml;sa mer om det i webbdesignh&auml;ftet. Underskatta inte planeringen, du kommer sj&auml;lv att m&auml;rka att det &auml;r en oerh&ouml;rd hj&auml;lp n&auml;r webbplatsen v&auml;xer.</p>
<hr>
<h3><strong>Efter HTML... </strong></h3>
<p>Eftersom HTML fr&aring;n b&ouml;rjan utformades f&ouml;r att kunna formatera text s&aring; blir inte alltid resultatet som &ouml;nskat eftersom sidorna idag n&auml;stan enbart best&aring;r av bilder, filmer o dyl. F&ouml;r att komma runt detta s&aring; har man skapat en del andra formateringsspr&aring;k och skriptspr&aring;k.</p>
<p>&nbsp; </p>
<p><strong>CSS-stilmallar </strong><br>
  CSS st&aring;r f&ouml;r Cascading Style Sheets, eller stilmall p&aring; svenska. Ett av de st&ouml;rsta problemen med HTML &auml;r dess brist p&aring; att anpassa layouter, med stilmallar kan man styra upp hur webbsidan skall se ut. N&auml;r du v&auml;l har skapat dig en stillmall kan du anropa denna f&ouml;r alla dina HTML-dokument. Du kan skriva dina stilmallar i t.ex Anteckningar och spara med filtill&auml;gget .css. Tyv&auml;rr handskas inte webbl&auml;sarna med stillmallar p&aring; ett standardiserat s&auml;tt och det finns en del buggar.</p>
<p>&nbsp; </p>
<p><strong>XML </strong><br>
  XML betyder eXtensible Markup Language (ut&ouml;kningsbart spr&aring;k f&ouml;r m&auml;rkning). I detta spr&aring;k kan man utforma sina egna taggar och hela spr&aring;ket bygger p&aring; samma grund som HTML (SGML) g&ouml;r. Med detta spr&aring;k s&aring; ska det vara l&auml;ttare att skapa sidor som ser likadana ut i b&aring;de Netscape och Explorer. F&ouml;r att skapa egna m&auml;rken g&ouml;r man ett dokument som kallas DTD (Document Type Definition). Detta dokument ligger till grund f&ouml;r beskrivningen av dina m&auml;rken och dess attribut.</p>
<p>&nbsp; </p>
<p><strong>XHTML </strong><br>
  F&ouml;r att underl&auml;tta anv&auml;ndandet av XML och HTML har W3C skapat en ny standard, som &auml;r en blandning av XML och HTML. </p>
<p>&nbsp;</p>
<p><strong>DHTML </strong><br>
  F&ouml;r att f&aring; sina webbsidor mer dynamiska och interaktiva finns &auml;ven den ut&ouml;kade HTML-kodningen, DHTML.</p>
<p>&nbsp; </p>
<p><strong>VRML </strong><br>
  VRML betyder Virtual Reality Markup Language. Detta anv&auml;nds f&ouml;r att skapa tredimensionella objekt. Det &auml;r ett spr&aring;k f&ouml;r att definiera form, f&auml;rg och plats p&aring; 3-dimensionella objekt. Det kan &auml;ven definiera saker som ljus, dimma, material och kopplingar mellan olika objekt. VRML &auml;r inte en ut&ouml;kning av HTML utan ett eget spr&aring;k, d&auml;remot kan VRML ing&aring; i en HTML-sida. </p>
<p>&nbsp;</p>
<p><strong>Flash </strong><br>
  N&auml;r man k&auml;nner att HTML-koden inte r&auml;cker till utan man vill ha mer av grafiken och gr&auml;nssnittet, s&aring; kan Macromedias Flash vara ett alternativ. Flash &auml;r ett verktyg f&ouml;r att skapa interaktiva menyer och bilder, &auml;ven ljud som MP3 kan anv&auml;ndas. All information &auml;r str&ouml;mmande (streaming) vilket inneb&auml;r att anv&auml;ndaren inte beh&ouml;ver v&auml;nta p&aring; att informationen skall laddas. F&ouml;r att du skall kunna se en Flash-fil kr&auml;vs det en plug-in, men det v&aring;llar inga problem eftersom det finns plug-in som standard b&aring;de i Explorer och Netscape idag. <br>
</p>
<p><strong>Skriptspr&aring;k </strong></p>
<p>Det finns m&aring;nga olika skriptspr&aring;k. Med dessa kan du till exempel skapa mer levande och dynamiska webbsidor &auml;n med bara ren html. Det kan vara fr&aring;gan om att ut&ouml;ka din webbsida med en speciell funktion eller applikation. N&aring;gra exempel p&aring; s&aring;dana skriptspr&aring;k f&ouml;ljer nedan. </p>
<p>&nbsp;</p>
<p><strong>PHP </strong><br>
  PHP, f&ouml;rkortningen kom ursprungligen fr&aring;n Personal Home Page Tools och d&auml;refter var det Pre Hypertext Processor. Den nyaste betydelsen av f&ouml;rkortningen (vad jag hittat) &auml;r <strong>PHP Hypertext Processor </strong>. <br>
  PHP har p&aring; kort tid blivit ett av de popul&auml;raste serverbaserade skriptspr&aring;ken. Killen bakom spr&aring;ket heter Rasmus Lerdorf och han hade nog inte en aning om hur genomslagskraftigt spr&aring;ket skulle bli. Anledningarna till att spr&aring;ket &auml;r s&aring; popul&auml;rt &auml;r att det &auml;r snabbt, stabilt och relativt enkelt att l&auml;ra sig. <br>
  <br>
  PHP &auml;r ett HTML-inb&auml;ddat skriptspr&aring;k som k&ouml;rs p&aring; serversidan, kortfattat inneb&auml;r detta att webbl&auml;saren som efterfr&aring;gar ett PHP-dokument f&aring;r ett rent HTML-dokument som svar. PHP-koden tolkas allts&aring; av servern, men skickas inte till webbl&auml;saren utan det anv&auml;ndaren ser som slutresultat &auml;r ett HTML-dokument. <br>
  <br>
  PHP fungerar i de flesta system, som till UNIX, Linux och Microsoft. Med PHP kan man smidigt skapa databaskopplingar och g&ouml;ra sina webbsidor mer dynamiska. PHP i sig sj&auml;lvt distribueras med &ouml;ppen k&auml;llkod. Det inneb&auml;r att den som &auml;r intresserad kan se hur spr&aring;ket &auml;r utformat, det inneb&auml;r ocks&aring; att det p&aring; n&auml;tet finns en massa fri kod, program och bibliotek att h&auml;mta. Vill du veta mer kan du titta in p&aring; adressen: <a href="http://www.php.net">www.php.net </a>. <br>
</p>
<p><strong>JavaScript </strong><br>
  Ett skriptspr&aring;k framtaget av Netscape som ett komplement till HTML-koden. JavaScript skall <strong>inte </strong> f&ouml;rv&auml;xlas med programmeringsspr&aring;ket Java &auml;ven om namnet kan f&aring; det att se ut s&aring;. Anledningen till att det namnet valdes var att det utseendem&auml;ssigt liknar Java och att de tillh&ouml;r samma f&ouml;retag.</p>
<p>&nbsp; </p>
<p><strong>JScript </strong><br>
  Ett skriptspr&aring;k framtaget av Microsoft som gjordes f&ouml;r att efterlikna JavaScript (ville konkurera med Netscape). De tv&aring; skriptspr&aring;ken fungerar v&auml;ldigt lika men eftersom dom inte &auml;r helt lika s&aring; f&aring;r JScript inte kallas f&ouml;r JavaScript. </p>
<p><strong>VBScript </strong></p>
<p><br>
    VBScript st&aring;r f&ouml;r Visual Basic Scripting Edition och &auml;r en nedbantad version av Visual Basic. Skriptspr&aring;ket &auml;r framtaget av Microsoft. Spr&aring;ket baseras som sagt p&aring; Visual Basic och &auml;r ytterligare ett f&ouml;rs&ouml;k av Microsoft att skapa ett spr&aring;k som kan konkurrera med JavaScript. </p>
<p>&nbsp;</p>
<p><strong>Perl </strong><br>
  Perl, st&aring;r f&ouml;r Practical Extraction and Reporting Language och togs fram f&ouml;r UNIX datorer. Perl anv&auml;nds bland annat f&ouml;r att ta emot formul&auml;rinmatningar i e-post. Det kr&auml;vs dock en "tolk" f&ouml;r detta skriptspr&aring;k.</p>
<p>&nbsp; </p>
<p><strong>Manus </strong></p>
<p>N&auml;r vi ska programmera f&ouml;r webben s&aring; m&aring;ste vi f&ouml;rst best&auml;mma vart de olika kommandona ska utf&ouml;ras. P&aring; servern eller p&aring; klienten (anv&auml;ndarens dator). Om man vill att kommandona ska utf&ouml;ras p&aring; servern s&aring; kan man anv&auml;nda sig av flera olika tekniker. Dom tv&aring; vanligaste &auml;r CGI och ASP. </p>
<p>F&ouml;rdelen med att k&ouml;ra ett program hos anv&auml;ndaren &auml;r att det g&aring;r snabbare att utf&ouml;ra de olika kommandona. Detta eftersom man inte f&ouml;rst m&aring;ste skicka informationen till servern, behandla informationen med serverprogrammet och sedan skicka tillbaka resultatet till anv&auml;ndaren. Datorn kan allts&aring; reagera direkt p&aring; vad du g&ouml;r. </p>
<p>Nackdelen med dessa "program" &auml;r att det finns m&aring;nga begr&auml;nsningar. Du kan exempelvis inte spara ner information p&aring; servern. Du kan bara anv&auml;nda de spr&aring;k som webbl&auml;saren klarar av att tolka. Ett &auml;nnu st&ouml;rre problem &auml;r att de olika webbl&auml;sarna tolkar kommandona olika vilket g&ouml;r att ett program som fungerar helt utm&auml;rkt i Netscape kanske inte fungerar alls i Microsofts Internet Explorer. Ett annat problem &auml;r att de olika webbl&auml;sarna st&ouml;der olika programspr&aring;k. </p>
<p>&nbsp;</p>
<p><strong>CGI </strong><br>
  CGI betyder Common Gateway Interface och &auml;r en standardiserad metod f&ouml;r att l&aring;ta ett program p&aring; en webbserver kommunicera med en webbl&auml;sare. CGI anv&auml;nds i huvudsak om operativsystemet p&aring; webbservern &auml;r n&aring;gon form av UNIX och ASP om det &auml;r Windows NT. Med hj&auml;lp av dessa tekniker kan du exempelvis g&ouml;ra s&aring; att olika sidor visas beroende p&aring; tid och datum eller beroende p&aring; vad anv&auml;ndaren gjort innan. <br>
  De vanligaste spr&aring;ken om man v&auml;ljer att g&ouml;ra ett program med CGI metoden &auml;r: Perl, Bash, C och C++. CGI-manus anses inte vara s&aring; s&auml;kra att anv&auml;nda, s&auml;rskilt inte f&ouml;r den webbserver de ligger p&aring;.</p>
<p>&nbsp; </p>
<p><strong>ASP </strong><br>
  ASP, betyder Active Sever Pages och &auml;r framtaget av Microsoft. ASP &auml;r inget skriptspr&aring;k i sig sj&auml;lv utan anv&auml;nds antingen med JavaScript, Perl, C++ eller med VBScript. ASP exekverar (k&ouml;r) sin kod p&aring; servern och sedan presenterar den f&auml;rdiga informationen till klienten. Detta anses vara ett mycket s&auml;kert s&auml;tt att behandla information p&aring;, bland annat anv&auml;nder en del Internet-banker ASP. </p>
<hr>
<h3>Programmeringsspr&aring;k </h3>
<p>Att programmera &auml;r ett s&auml;tt att ber&auml;tta f&ouml;r datorn hur den ska bete sig i olika situationer. De olika s&auml;tten att styra utf&ouml;randet av olika funktioner kallas f&ouml;r programmeringsspr&aring;k eller skriptspr&aring;k. <br>
  Den stora skillnaden mellan ett formateringsspr&aring;k som HTML och ett programmeringsspr&aring;k som exempelvis C++ &auml;r att programmeringsspr&aring;ket kan utf&ouml;ra olika saker beroende p&aring; vad anv&auml;ndaren hittar p&aring;, medans ett formateringsspr&aring;k bara s&auml;tter upp regler f&ouml;r hur n&aring;gonting ska se ut. </p>
<p><strong>Java </strong><br>
  Ett programmeringsspr&aring;k framtaget av Sun Microsystems. Java skiljer sig fr&aring;n de andra programmeringsspr&aring;ken f&ouml;r att man kompilerar en del av programmen innan dom hamnar hos anv&auml;ndaren. N&auml;r programmet sedan k&ouml;rs anv&auml;nds en typ av tolk f&ouml;r att &ouml;vers&auml;tta dom sista delarna. Anledningen till detta &auml;r att programmen ska kunna k&ouml;ras fr&aring;n vilken dator som helst som har denna tolken (plattformsoberoende). En s&aring;dan tolk finns med i b&aring;de Netscape och Internet Explorer.</p>
<p>&nbsp; </p>
<p><strong>C och C++ <br>
  </strong>Java &auml;r baserat p&aring; C++, som tillh&ouml;r de popul&auml;raste programmeringsspr&aring;ket f&ouml;r avancerade till&auml;mpningar. Dessa spr&aring;k &auml;r v&auml;l strukturerade och bygger p&aring; att all kod skrivs som en eller flera funktioner. &Auml;ven h&auml;r kr&auml;vs det en kompilator.</p>
<hr>
<p>&nbsp; </p>
<h3>Editorer </h3>
<p align="left">HTML-editorer &auml;r program som l&auml;gger in och formaterar HTML-taggar i den text och de bilder man vill ha med p&aring; sin webbsida. En del klarar ocks&aring; av att infoga JavaScript, Javaapplets, DHTML, tabeller och ramar. </p>
<p align="left">En editor underl&auml;ttar arbetet med webbsidor avsev&auml;rt och sparar mycket tid om du arbetar med en stor produktion. Faktum &auml;r att du slipper skriva in HTML-koden sj&auml;lv och i st&auml;llet kan koncentrera dig p&aring; inneh&aring;llet p&aring; sidan. Men f&ouml;r att f&aring; ut s&aring; mycket som m&ouml;jligt av editorn b&ouml;r du kunna HTML s&aring; att du kan g&aring; in i HTML-koden och &auml;ndra och precisera s&aring; att du f&aring;r sidan exakt som du vill. En editor &auml;r till f&ouml;r att underl&auml;tta ditt jobb, inte ers&auml;tta det. </p>
<p align="left">Det finns en rad olika HTML-editorer. Vissa &auml;r gratisprogram som kan laddas hem fr&aring;n Internet medan andra finns att k&ouml;pa. Det finns ocks&aring; tv&aring; olika typer av editorer: </p>
<ul>
  <li>Text-editorer - Hj&auml;lper dig att skriva taggarna. Ofta en katalog med massor av taggar och attribut. Ett exempel p&aring; en texteditor &auml;r gratisprogrammet <a href="http://www.notetab.com.">Note tab light </a>. <br>
      <br>
  <li>WYSIWYG-editorer (What you see is what you get)- H&auml;r jobbar du i en grafisk milj&ouml; och beh&ouml;ver inte titta p&aring; HTML-koden, vilket har b&aring;de f&ouml;r och nackdelar. </li>
</ul>
<p align="left"><br>
  I webbl&auml;sarna Microsoft Explorer och Netscape finns ocks&aring; HTML-editorer som du kan bygga dina sidor i. Nackdelen med m&aring;nga av dessa &auml;r att de f&auml;rdiga resultaten ser olika ut i olika webbl&auml;sare eftersom de ofta skriver mycket "skr&auml;p-kod". </p>
<p align="left">&nbsp;</p>
<p align="left"><strong>Dreamweaver </strong><br>
  Macromedias HTML-editor, Dreamweaver, &auml;r en av de ledande editorerna som dessutom g&aring;r att komma &ouml;ver till ett hyfsat pris. Den fungerar som ett desktop publishing-program d&auml;r du klistrar in bilder och skriver text d&auml;r du vill ha dem och visar sidan som den skulle se ut i en webbl&auml;sare. Texthanteringen i Dreamweaver &auml;r mycket lik den i de flesta moderna ordbehandlingsprogrammen. Det finns ocks&aring; m&ouml;jlighet att g&ouml;ra fil&ouml;verf&ouml;ring direkt i programmet. <br>
  Denna kurs &auml;r kodad i Dreamweaver  MX, men eftersom jag har m&aring;nga exempel-koder har ocks&aring; jag varit en hel del i HTML-f&ouml;nstret och kodat om. </p>
<p align="left">&nbsp;</p>
<p align="left"><strong>Frontpage </strong><br>
&Auml;r Microsofts webbredigeringsprogram som finns i en del olika versioner. Den nyaste - Frontpage 2000 &auml;r n&auml;stan helt omgjord fr&aring;n tidigare versioner och mycket b&auml;ttre. I tidigare versioner gick programmet in och &auml;ndrade HTML-kod sj&auml;lv, men detta problem &auml;r nu borta. &Auml;ven h&auml;r finns det m&ouml;jlighet att g&ouml;ra fil&ouml;verf&ouml;ring direkt i programmet, om jag inte misstar mig.</p>
<hr>
<h3 align="left"><strong>Meta-taggar </strong>    </h3>
    <p>De flesta som s&ouml;ker information p&aring; n&auml;tet anv&auml;nder s&ouml;kmotorer som t. ex Lycos eller Altavista. Om du vill att m&aring;nga anv&auml;ndare skall hitta till din webbsida b&ouml;r du anm&auml;la den till olika s&ouml;kmotorer. Hur du g&aring;r till v&auml;ga f&aring;r du l&auml;sa om p&aring; s&ouml;kmotorernas supportsidor. <br>
    <br>
    N&auml;r din sida hittas av en s&ouml;ktj&auml;nst s&aring; presenteras den under det namn du har valt som titelnamn, <strong>&lt;TITLE&gt; </strong>. Titelnamnet fungerar som rubrik till din sida, d&auml;rf&ouml;r &auml;r det viktigt att du v&auml;ljer ett passande namn. <br>
    <br>
    F&ouml;r att s&ouml;kmotorerna skall veta vilken information din sida inneh&aring;ller och f&ouml;r att specifiera dina s&ouml;kord anv&auml;nder du META-taggar. Taggen skall skrivas i index-filen och kan ha attributen NAME och CONTENT. <br>
    Meta-taggen skrivs i HTML-dokumentets huvud, allts&aring; HEAD. En del s&ouml;kmotorer visar &auml;ven en beskrivande text om webbsidan. Du kan &auml;ven anv&auml;nda Meta-taggarna f&ouml;r att uppdatera eller ladda en ny sida efter en given tid. <br>
    Om du &auml;r nyfiken kan du titta p&aring; k&auml;llkoden p&aring; denna sida (Visamenyn--&gt;K&auml;lla) f&ouml;r att se mina Meta-taggar du kan ocks&aring; titta i taggarkivet, s&aring; f&ouml;rst&aring;r du hur de skall kodas.</p>
    <hr>
    <h3 align="left"><strong>Publicera via FTP </strong></h3>
        <br>
  <p>Detta avsnitt tar upp lite om hur man l&auml;gger ut webbsidor p&aring; Internet. S&aring; h&auml;r l&aring;ngt in i kursen har allt du skapat enbart sparats ner lokalt p&aring; din h&aring;rddisk. <br>
  F&ouml;r att din sida skall kunna hittas p&aring; Internet m&aring;ste den ligga p&aring; en webbserver. En webbserver &auml;r en dator som &auml;r uppkopplad mot Internet dygnet runt. F&ouml;rutom detta &auml;r datorn utrustad med speciella program som g&ouml;r att den kan skicka HTML-dokument, bilder och annat som h&ouml;r till en webbsida till "surfaren". <br>
  Det som i grova drag sker n&auml;r du surfar &auml;r att din dator skickar en f&ouml;rfr&aring;gan till en webbserver som sedan skickar en kopia p&aring; webbsidan tillbaka till din dator. </p>
    <p align="left">Det finns ganska m&aring;nga webbservrar d&auml;r du helt gratis kan f&aring; lite utrymme f&ouml;r att l&auml;gga din webbsida p&aring; <a href="../lankar.htm">se l&auml;nklista </a>. Det brukar g&aring; till s&aring; att man skapar sig ett konto med anv&auml;ndarnamn och l&ouml;senord. Exakt hur man g&aring;r till v&auml;ga st&aring;r givetvis p&aring; sidan. N&auml;r du ordnat ett webbkonto ska du kopiera &ouml;ver alla filer som utg&ouml;r din webbsida till webbservern. </p>
    <p align="left"><strong>FTP </strong><br>
  FTP st&aring;r f&ouml;r <strong>File Transfer Protocol </strong>. FTP &auml;r ett protokoll f&ouml;r att skicka filer &ouml;ver Internet. Enkelt sett skulle man kunna s&auml;ga att FTP &auml;r ett slags spr&aring;k som din dator anv&auml;nder f&ouml;r att prata med en server och skicka filer till den. </p>
    <p align="left">P&aring; din dator beh&ouml;ver du ett program/en klient som anv&auml;nder FTP f&ouml;r att kunna skicka filer. I Windows brukar man anv&auml;nda programmet WS-FTP och p&aring; Mac anv&auml;nds ofta Fetch. Programmen finns bland annat att h&auml;mta p&aring; <a href="http://www.download.com">www.download.com </a>S&ouml;k efter WSFTP eller CUTE FTP. V&auml;lj sedan n&aring;gon av FTP-programmen f&ouml;r nedladdning. F&ouml;lj instruktionerna f&ouml;r nedladdningen och instruktionerna f&ouml;r att fylla i de obligatoriska f&auml;lten korrekt. </p>
    <p align="left">F&ouml;r att anv&auml;nda ett FTP-program kr&auml;vs det att du &auml;r uppkopplad mot Internet och att du sedan valt vilken server du ska skicka filerna till. </p>
    <p align="left"><strong>De fyra obligatoriska uppgifterna som kr&auml;vs vid fil&ouml;verf&ouml;ring &auml;r: </strong></p>
    <ol>
      <li><strong>FTP-adressen till servern </strong> - Om webb-adressen (www) till din sida &auml;r www.pingvin.com s&aring; brukar FTP-adressen vara ftp.pingvin.com, men m&aring;nga g&aring;nger g&aring;r det ocks&aring; bra att anv&auml;nda webb-adressen.
      <li><strong>Ditt anv&auml;ndarnamn </strong> - Det namn du f&aring;tt av den som tillhandah&aring;ller servern.
      <li><strong>Ditt l&ouml;senord </strong> - Tillsammans med ditt anv&auml;ndarnamn s&aring; g&ouml;r l&ouml;senordet att du ensam har tilltr&auml;de till din webbplats genom FTP. Med andra ord s&aring; &auml;r du den enda som kan &auml;ndra i din hemsida.
      <li><strong>Tilldelad katalog p&aring; server - </strong> Om du bara har f&aring;tt tillg&aring;ng till en katalog och inte en hel dom&auml;n p&aring; servern s&aring; m&aring;ste du specificera detta n&auml;r du kopplar upp dig mot servern. Till exempel kan du ha f&aring;tt en webb-adress som &auml;r www.algonet.se/~carina. Carina &auml;r din katalog som bara du har r&auml;tt att &auml;ndra i. </li>
    </ol>
    <p align="center"><img height="326" src="bilder2/ftp-bild2.gif" width="400"></p>
    <p>Genom ditt FTP-program s&aring; ser du katalogerna i listor p&aring; samma s&auml;tt som p&aring; din egen dator. Det h&auml;r f&ouml;nstret f&aring;r du upp p&aring; sk&auml;rmen n&auml;r du startar WS-FTP och alla uppgifter &auml;r korrekt ifyllda. Sedan &auml;r det bara att b&ouml;rja skicka filer till ditt hemsideskonto. Markera filerna till v&auml;nster och klicka p&aring; pilen som pekar &aring;t h&ouml;ger mellan f&ouml;nstren. Bli inte r&auml;dd n&auml;r det "plingar" till i din dator - det inneb&auml;r att filen/filerna du markerat har &ouml;verf&ouml;rts korrekt. I det breda gr&aring;a f&auml;ltet nedanf&ouml;r visas information om kommunikationen mellan servern och din dator. </p>
    <p align="center"><img height="263" alt="Ftp-bild" src="bilder2/ftp-bild.gif" width="400"></p>
    <p align="left"><strong>Vanliga felmeddelanden </strong></p>
    <ul>
      <li>Om det inte visas n&aring;gra filer i det h&ouml;gra f&auml;ltet s&aring; betyder det att din uppkoppling mot servern har misslyckats. Detta beror i s&auml;llsynta fall p&aring; att servern just d&aring; har kraschat. Det vanligaste felet &auml;r dock att anv&auml;ndaren skrivit in fel FTP-adress, anv&auml;ndarnamn eller l&ouml;senord.
      <li>Om du f&aring;r meddelandet <strong>Can&acute;t get host entry </strong> i det gr&aring;a breda f&auml;ltet s&aring; har du skrivit in fel adress till servern.
      <li>Om du f&aring;r meddelandet <strong>Login Incorrect </strong> s&aring; betyder det att antingen l&ouml;senordet eller anv&auml;ndarnamnet &auml;r fel. </li>
    </ul>
    <p>Den sida som du vill ha som din f&ouml;rstasida m&aring;ste du d&ouml;pa till <strong>"index.html" </strong>. (med sm&aring; bokst&auml;ver!) D&aring; vet webbl&auml;sarna att det &auml;r din f&ouml;rstasida. Om det inte finns en index.html i din katalog s&aring; kommer bara en lista &ouml;ver filerna som finns d&auml;r att visas i st&auml;llet n&auml;r n&aring;gon surfar in. </p>
    <hr>
    <h3>Lagar p&aring; n&auml;tet </h3>
    <p align="left">N&auml;r man pratar om Internet, namns det ofta som ett fritt media. Faktum &auml;r att det g&auml;ller h&aring;rda regler p&aring; Internet, precis som i alla andra media-produktioner. </p>
    <p align="left"><strong>Upphovsr&auml;tt </strong><br>
  Den person eller f&ouml;retag som skapar n&aring;got, t ex en bok eller ett konstverk eller en programvara, kallas f&ouml;r verkets upphovsman. Det &auml;r alltid upphovsmannen som f&aring;r best&auml;mma hur verket f&aring;r anv&auml;ndas och spridas. Denne person eller f&ouml;retag har allts&aring; upphovsr&auml;tt enligt upphovsr&auml;ttslagen. Beroende p&aring; vad som skapas s&aring; g&auml;ller upphovsr&auml;tten olika l&auml;nge. </p>
    <p align="left">H&auml;r inr&auml;knas t ex varum&auml;rken, programmeringskod, foton, musik, texter med mera. F&ouml;r att kunna anv&auml;nda sig av ovanst&aring;ende m&aring;ste man f&ouml;rst skaffa sig tillst&aring;nd fr&aring;n upphovsman annars bryter man mot lagen.</p>
    <p align="left">&nbsp; </p>
    <p align="left"><strong>Verk p&aring; Internet </strong><br>
  N&auml;r det g&auml;ller grafik p&aring; Internet inneb&auml;r upphovsr&auml;tten att det endast &auml;r till&aring;tet att &aring;teranv&auml;nda bilder som finns utlagda p&aring; Internet om det uttryckligen st&aring;r att bilderna f&aring;r anv&auml;ndas fritt. Undantaget &auml;r enkla grafiska element som inte uppvisar n&aring;gon originalitet. <br>
  F&ouml;r ClipArt-bilder som medf&ouml;ljer ett bildbibliotek, g&auml;ller det att noga l&auml;sa informationen som medf&ouml;ljer ang&aring;ende &aring;teranv&auml;ndning. Musik, film och texter f&aring;r inte heller anv&auml;ndas utan upphovsmannens och utgivarens tillst&aring;nd. &Auml;ven typsnitt &auml;r skyddade av upphovsr&auml;tten. <br>
    </p>
    <p align="left"><strong>PUL - Personuppgiftslagen <br>
      </strong>1998 antog riksdagen en ny lag, Personuppgiftslagen (PUL), som ersatte datalagen. Den nya lagen &auml;r anpassad till EU. <br>
  PUL &auml;r till f&ouml;r att skydda den enskilda personens integritet. Detta inneb&auml;r att man inte f&aring;r anv&auml;nda sig av personers namn eller personnummer utan att fr&aring;ga f&ouml;rst. <br>
  Denna lag omfattar all automatiserad behandling av personuppgifter och dessutom manuell behandling. I lagen anges ocks&aring; n&auml;r behandling av personuppgifter &auml;r till&aring;ten, f&ouml;r k&auml;nsliga uppgifter finns s&auml;rskilda, str&auml;nga regler. PUL har utsats f&ouml;r en hel del kritik pga. att lagen inte &auml;r anpassad till webben.</p>
    <p align="left">&nbsp; </p>
    <p align="left"><strong>Etik och moral p&aring; Internet </strong><br>
  Ordet etik kan definieras som " <strong>l&auml;ran om vad som &auml;r r&auml;tt och or&auml;tt" </strong>. N&auml;r man pratar med n&aring;gon om etik och etiska fr&aring;gor skall man komma ih&aring;g att det inte finns n&aring;gra entydiga svar eller l&ouml;sningar. <br>
  Det som k&auml;nns etiskt riktigt f&ouml;r mig kanske inte alls st&auml;mmer med den jag pratar med. Det finns etiska regler f&ouml;r medier som TV, radio och press. Dessa regler &auml;r till f&ouml;r att skydda enskilda mot lidande genom obefogad publicering. <br>
  Men finns det etik och moral p&aring; n&auml;tet? F&ouml;rbjudet och oetiskt material som kontrolleras i traditionella medier, kan spridas okontrollerat &ouml;ver hela v&auml;rlden inom loppet av n&aring;gra sekunder. I traditionella medier kan man oftast peka ut en ansvarig om etiska felaktigheter beg&aring;tts, medan detta &auml;r sv&aring;rt p&aring; Internet. </p>
    <p align="left">P&aring; Internet g&auml;ller det att den enskilda anv&auml;ndaren tar st&auml;llning till vad som &auml;r etiskt f&ouml;rsvarbart. Eftersom Internet &auml;r ett globalt medium kan det vara sv&aring;rt att skapa gemensamma etiska regler. En grundregel f&ouml;r vad som &auml;r l&auml;mpligt att publicera p&aring; Internet, borde vara s&aring;dant som &auml;r lagligt i andra medier. Det vill s&auml;ga s&aring;dant som inte anses kr&auml;nkande f&ouml;r annan person.</p>
    <p align="left">&nbsp; </p>
    <p align="left"><strong>Netiquette - netikett </strong><br>
  Det f&ouml;rsvenskade ordet, kunna netikett, skulle kunna f&ouml;rklaras som en sammandragning av n&auml;tverksetikett. Det &auml;r viktigt att n&auml;tanv&auml;ndare &auml;r medvetna om sitt ansvar f&ouml;r de n&auml;tresurser de kan nyttja. Internet &auml;r som sagt en sammanslagning av en massa n&auml;tverk och trafiken som passerar p&aring; Internet passerar flera olika n&auml;tverk innan det n&aring;r mottagaren. <br>
  Varje n&auml;tverk har sina egna regler och f&ouml;reskrifter. Det som &auml;r till&aring;tet i det ena systemet, kan vara strikt f&ouml;rbjudet i det andra. <br>
  Anv&auml;ndandet av ett n&auml;tverk &auml;r ett privilegium och inte en r&auml;ttighet om man p&aring; olika s&auml;tt missbrukar detta privilegium kan detta bli indraget. Missbruk kan vara: </p>
    <ul>
      <li>Ol&auml;mpligt spr&aring;kbruk
      <li>Spridandet av massbrev och reklam
      <li>Ol&auml;mpliga bilder
      <li>Spridande av filer som kan skada andras systemresurser till exempel virus
      <li>Annan &ouml;verbelastning som kan skada andra personers arbeten
      <li>Rasism och hets mot folkgrupp </li>
    </ul>
    <p>&nbsp;      </p>
    <p align="center"><strong><a href="Uppgifter2/uppgift11.htm" target="_blank">B&ouml;rja med uppgift 11! </a></strong></p>
</div>
<div id="kolumn2">  
  <h3 align="left"> Resurser</h3>
  <p align="left"><a href="Resurser/studierod.htm" target="_blank">Studier&aring;d</a><br>
    <a href="Resurser/fargkarta.htm" target="_blank">Webbs&auml;kra f&auml;rger </a><br>
        <a href="Resurser/taggarkiv.htm" target="_blank">Taggarkiv</a><br>
        <a href="Resurser/lankarkiv.htm" target="_blank">L&auml;nkarkiv</a><br>
        <a href="Resurser/kapitelguide.htm" target="_blank">Kapitelguide
        </a><br>
        <a href="slutuppgift.htm" target="_blank">Slutuppgift
        </a><br>
      <a href="Resurser/utvardering.htm" target="_blank">Utv&auml;rdering</a> </p>
  <h3 align="left">        <br>
        <br>
     </h3>
</div>
</div>
 <div id="sidfot">
   <div align="left"><a href="mailto:carina.minell@harnosand.se">Carina Minell ©</a>  &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 

Rekommenderad uppl&ouml;sning: 1152*864&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;

Senast uppdaterad: 090819 </div>
 </div>
</div>
</body>
</html>
